// بسم الله الرحمن الرحيم و به نستعين و الصلاه على رسول الله سيد الخلق اجمعين

//**1** احد الملاحظات الجميله :: هى انك ممكن تعمل فانكشن معينه سواء بقى انينيموس فانشكن او لا او ليها ارجيومنتس او لا برضو فى ال بيرنت كومبوننت مثلا تمام و تستخدمها ك (بروبس) فى ال اتشيلد كومبوننت بانك تقول ==> اى اسم فى الاوبجيكت بروبس = <زيس.اسم الفانكشن> و كمان من غير علامات الفانكشن() و دا برضو فى حاله انها ليها ارجيومنتس ف ال بيرنت كومبوننت عادى جداً ... تمام اوووى كدا

// تعالا بقى لل اتشيلد كومبوننت و نشوف ازاى هنستخدم الفانشكن دى الى بقت واحده من البروبس بتاع الاتشيلد كومبوننت دا ؟
// الوقتى اول حاجه احنا ممكن نستخدم الديستركشرينج علشان ناخد من الاوبجيكت بروبس الكى الى شايل الفانكشن دى باننا نعمل الديستركشيرنج بتاع الاوبجيكت تمام و احنا عارفين الطريقه كويس .. تمام جداً
// تعالا بقى لو انتا عايز تستخدم الفانكشن دى عند ايفينت مثلا (اون كليك فى زرار) الحل هنا انك هتدخل للزرار بتاعك و هتعمل الايفينت او كليك بتاع = ( ()=> الفاريبول الى شايل الفانكشن الى جبناه من البروبس ) طيب ليه عملنا الاروو فانشكن قبل الفانكشن او الفاريبل الى شايل الفانكشن دا علشان الفانشكن الى جايبنها من البروبس متشتغلش الا عند الكليك بس غير كدا هتلاقيها اشتغلت لوحدها بدون ما تعمل الايفينت بتاع الكليك على الزرار... كدا تمام جداً الحمد لله 


//**2** فى ملاحظه و هى لو انا مستعمل فانشكن فى ال بيرنت كومبوننت و مررتها الى البروبس بتاع اتشيلد كومبوننت و الفانشكن دى بتقبل ارجيومنت ليها و مثلا انا عايز اشغلها فى البيرنت كومبوننت اما ادوس على عنصر فى الاتشيلد كومبوننت تمام ؟

// هنا انتا اما انتا تعمل الايفينت بتاع الكليك على عنصر ما فى الاتشيلد كومبوننت و تخليه بيساوى الفانشكن دى او الفاريبول الى شايلها من البروبس بتاع الكومبوننت دا ---> هنا انتا لو حطيت اى ارجيومنت للفانشكن دى => كدا تعتبر انك بتشغلها عند الكليك و بتمرر الارجيومنت دا الى البيرنت كومبوننت (يعنى عند الكليك انتا بتشغل الفانكشن الى ف البيرنت كومبوننت و كمان الارجيومنت بتاعها بناخده من الاتشيلد كومبوننت) كدا تمام الحمد لله

// فى نقطه جميله جداً  :: و هى انك ممكن تشغل الفانشكن فى البيرنت و الاتشيلد كومبوننت عادى جداً و انك تستعملها عادى فى الاتشيلد كومبوننت و تشغلها فى البيرنت كومبوننت جوا من ضمن البوودى بتاع الفانكشن دى و دا بانك ---> هتنادى على البروبس بتاع الاتشيلد كومبوننت و تجيب منه الفانكشن دى (الى واخدينها من البيرنت كومبوننت) و تديلها كمان الارجيومنت الى انتا عايزها عادى جداً ====> بص عل المثال بتاع اما كنا بنضيف العناصر فى ال تو-ددو ااب


//**3** تقريباً كل العمليات بتتم على انك تربط الاستيت و البروبس بتاع الاتشيلد كومبوننتس بالاستيت بتاع البيرنت كومبوننت و كمان ازاى انك تقدر تعمل شغل عكسى بانك تستعمل الاستيت بتاع الاتشيلد كومبوننت فى التعديل على البروبس بتاعه الى بدوره بياثر على الاستيت بتاع البيرنت كومبوننت و بامانه الشغل ممتع جداً و بالاخص انك بتستعمل اكوواد (جى اس اكس) كلها بعيد عن اى كوود جافاسكريبت... و ان شاء الله مع شويه تدريب و شغل الدنيا هتبقى جميله جداً بامر الله ... الحمد لله حمداً ملئ السموات و الارض .. الحمد لله حمداً طيباً مباركاً فيه.. الحمد لله حمداً كثيراً